Revit 2024 API
FabricationPartBrowserChangedEventArgs.GetAllSolutionsPartsTypeCounts Method
 Returns the total fabrication part type usage count in all routing solutions.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public IDictionary<ElementId, int> GetAllSolutionsPartsTypeCounts()
Visual Basic
Public Function GetAllSolutionsPartsTypeCounts As IDictionary(Of ElementId, Integer)
Visual C++
public:
IDictionary<ElementId^, int>^ GetAllSolutionsPartsTypeCounts()
See Also
FabricationPartBrowserChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace